In [1]:
import pandas as pd

## Raw data

In [2]:
raw_df = pd.read_csv("sales_raw.csv")

In [3]:
print("First 5 rows:")
raw_df.head()

First 5 rows:

,sale_id,date,client_id,product,quantity,unit_price,region
0,1,2025-09-13 10:41:26,148,Webcam,3,382.40,East
1,2,2025-10-04 20:32:47,136,Screen,1,745.12,North
2,3,2025-11-04 13:25:54,45,Mouse,1,955.44,North
3,4,2025-11-05 22:38:48,170,Mouse,4,1193.58,East
4,5,2025-11-05 07:46:11,83,Laptop,6,647.42,South

In [4]:
print("Dataset information:")
raw_df.info()

Dataset information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   sale_id     1000 non-null   int64
 1   date        1000 non-null   object
 2   client_id   1000 non-null   int64
 3   product     1000 non-null   object
 4   quantity    1000 non-null   int64
 5   unit_price  1000 non-null   float64
 6   region      1000 non-null   object
dtypes: float64(1), int64(3), object(3)
memory usage: 54.8+ KB

In [5]:
print("Null values:")
raw_df.isnull().sum()

Null values:

sale_id       0
date          0
client_id     0
product       0
quantity      0
unit_price    0
region        0
dtype: int64

In [6]:
print("Basic statistics:")
raw_df.describe()

Basic statistics:

           sale_id    client_id     quantity   unit_price
count  1000.000000  1000.000000  1000.000000  1000.000000
mean    500.500000   100.111000     3.504000   801.579750
std     288.819436    58.199036     1.710237   465.041957
min       1.000000     1.000000     1.000000    10.910000
25%     250.750000    49.000000     2.000000   381.737500
50%     500.500000    99.000000     4.000000   815.310000
75%     750.250000   151.000000     5.000000  1188.805000
max    1000.000000   200.000000     6.000000  1599.380000

## Transformed data

In [7]:
tr_df = pd.read_csv("transformed_sales.csv")

In [8]:
print("First 5 rows:")
tr_df.head()

First 5 rows:

,sale_id,date,client_id,product,quantity,unit_price,region,total_sale,year,month,day,sales_category
0,1,2025-09-13 10:41:26,148,Webcam,3,382.40,East,1147.20,2025,9,Saturday,Big
1,2,2025-10-04 20:32:47,136,Screen,1,745.12,North,745.12,2025,10,Saturday,Big
2,3,2025-11-04 13:25:54,45,Mouse,1,955.44,North,955.44,2025,11,Tuesday,Big
3,4,2025-11-05 22:38:48,170,Mouse,4,1193.58,East,4774.32,2025,11,Wednesday,Big
4,5,2025-11-05 07:46:11,83,Laptop,6,647.42,South,3884.52,2025,11,Wednesday,Big

In [9]:
print("Dataset information:")
tr_df.info()

Dataset information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sale_id         1000 non-null   int64
 1   date            1000 non-null   object
 2   client_id       1000 non-null   int64
 3   product         1000 non-null   object
 4   quantity        1000 non-null   int64
 5   unit_price      1000 non-null   float64
 6   region          1000 non-null   object
 7   total_sale      1000 non-null   float64
 8   year            1000 non-null   int64
 9   month           1000 non-null   int64
 10  day             1000 non-null   object
 11  sales_category  1000 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 93.9+ KB

In [10]:
print("Null values:")
tr_df.isnull().sum()

Null values:

sale_id           0
date              0
client_id         0
product           0
quantity          0
unit_price        0
region            0
total_sale        0
year              0
month             0
day               0
sales_category    0
dtype: int64

In [11]:
print("Basic statistics:")
tr_df.describe()

Basic statistics:

,sale_id,client_id,quantity,unit_price,total_sale,year,month
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.0,1000.000000
mean,500.500000,100.111000,3.504000,801.579750,2803.850670,2025.0,9.397000
std,288.819436,58.199036,1.710237,465.041957,2282.877381,0.0,0.938228
min,1.000000,1.000000,1.000000,10.910000,10.910000,2025.0,8.000000
25%,250.750000,49.000000,2.000000,381.737500,988.085000,2025.0,9.000000
50%,500.500000,99.000000,4.000000,815.310000,2148.710000,2025.0,9.000000
75%,750.250000,151.000000,5.000000,1188.805000,4277.667500,2025.0,10.000000
max,1000.000000,200.000000,6.000000,1599.380000,9596.280000,2025.0,11.000000